Revit 2027 API
ParameterTypeId.StructuralAnalyticalColumnRigidLink Property
 "Analytical Links"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalColumnRigidLink { get; }
Public Shared ReadOnly Property StructuralAnalyticalColumnRigidLink As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalColumnRigidLink {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalColumnRigidLink : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace